Autodesk.Revit.DB.PointOnFace.UV
The location of the point in the surface's coordinate system.

Autodesk.Revit.DB.PointOnFace.SetFaceReference(Autodesk.Revit.DB.Reference)
Change the face reference.
Remarks: The referenced element may be any model element, including
FamilyInstance or FormElement. The reference
must be of type ElementReferenceType.REFERENCE_TYPE_SURFACE,
and the surface must be of type Autodesk.Revit.DB.Plane.
The Reference's UVPoint property is ignored.

Autodesk.Revit.DB.PointOnFace.GetFaceReference
Get a copy of the face reference.

Autodesk.Revit.DB.PointOnFace
Define a ReferencePoint relative to a Face.
Remarks: A ReferencePoint on a Face has its X and Y
basis vectors parallel to the Face, but is free to rotate
around its Z basis vector. It must lie on the face
(unlike PointOnPlane).